#+title: Git
#+author: Pablo Andres Dealbera

*** Repositorio
Un repositorio en Git no es mas que una carpeta que contiene un
directorio oculto ~.git/~ donde se almacenan todos los archivos
gestionados por el sistema.

#+begin_src bash :results output
tree .git
#+end_src
#+RESULTS:
#+begin_example
.git
├── branches
├── config
├── description
├── HEAD
├── hooks
│   ├── applypatch-msg.sample
│   ├── commit-msg.sample
│   ├── fsmonitor-watchman.sample
│   ├── post-update.sample
│   ├── pre-applypatch.sample
│   ├── pre-commit.sample
│   ├── pre-merge-commit.sample
│   ├── prepare-commit-msg.sample
│   ├── pre-push.sample
│   ├── pre-rebase.sample
│   ├── pre-receive.sample
│   ├── push-to-checkout.sample
│   └── update.sample
├── info
│   └── exclude
├── objects
│   ├── info
│   └── pack
└── refs
    ├── heads
    └── tags

9 directories, 17 files
#+end_example

*** Commit

Un commit representa un cambio hecho a nuestro repositorio. Git
utiliza commits para mantener registros de todos los cambios hechos
durante el ciclo de vida de un repo y contiene metadata acerca de
quien realizo los cambios, cuando, y que cambios hizo sobre que archivos.

#+begin_src bash :results output
git show
#+end_src

#+RESULTS:
: commit e236cfb49f83b8135ded4d71b44117e184c9a2da
: Author: Pablo Andres Dealbera <pdealbera@fi.uba.ar>
: Date:   Thu Jun 9 01:12:15 2022 -0300
: 
:     Initial commit

** Iniciar un repositorio
Podemos ir a un directorio vacio y correr:
#+begin_src bash :results output
git init
#+end_src
#+RESULTS:
: Initialized empty Git repository in <algun-lugar>/algoritmos-programacion-II/colab/clases/git/.git/

** Estado del repositorio
#+begin_src bash :results output
git status
#+end_src

#+RESULTS:
#+begin_example
On branch master

No commits yet

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	assets/
	presentacion.org

nothing added to commit but untracked files present (use "git add" to track)
#+end_example

_Untracked files_ son archivos que todavia no pertenecen al repositorio

** Agregar un archivo
#+begin_src bash :results output
git add presentacion.org
git status
#+end_src

#+RESULTS:
#+begin_example
On branch master

No commits yet

Changes to be committed:
  (use "git rm --cached <file>..." to unstage)
	new file:   presentacion.org

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	assets/

#+end_example

** Commit
#+begin_src bash :results output
git commit -m "agrego presentacion.org"
#+end_src

#+RESULTS:
: [master (root-commit) 7e1162b] agrego presentacion.org
:  1 file changed, 211 insertions(+)
:  create mode 100644 presentacion.org

_Nota:_ correr solo ~git commit~ usara el editor que este configurado
en la variable de entorno ~EDITOR~

